import axios from "axios";

export  function getText(){
    // const res = await axios.get('http://localhost:8888/get_text');
//    return res;

    return Promise.resolve({
        body: `
        ጥቁሯ ድቡልቡል የወንዝ ጠጠር ዛሬም እንደወትሮዋ በሐዘን ጭብጥ ኩርምት ብላለች፡፡ ምክንያቷ ትላልቆቹ ጥቁር ድንጋዮች ስላበሳጯት ነው፡፡ የሚያበሳጯት ዋነኛ ምክንያት ደግሞ ትንሽ በመሆኗ ነው፡፡ ኃጢያቷ ህፃንነቷ ነው፡፡ በደሏ እንደነሱ ግዙፍ ድንጋይ አለመሆኗ ነው፡፡ እንደነሱ በሰዎች ዘንድ ተፈላጊ አለመሆኗ፡፡ ሰዎች ብዙ ጊዜ ትላልቆቹን ነው የሚፈልጓቸው፤ በተለይም ቤት ሊሠሩ ሲፈልጉ፣ መንገድ ሊገነቡ ሲፈልጉ፣ እነሱን ነው የሚፈልጉት፡፡ እንጂማ እሷም የድንጋይ ዘር ጠጠር ናት፡፡ ለዚያውም ጥቁር ድቡልቡል፡፡ ግን ሁልጊዜ ስለታናሽቷ ስታስብ ደርሶ ክፍት ይላታል፡፡ እኔስ መቼ ነው ትልቅ ሆኜ በወገኖቼ ሳልናቅ ተከብሬ የምኖረው ትላለች፡፡ መቼ ነው በሰዎች ህልውና ውስጥ የማይሽር አሻራ የማሳርፈው ትላለች፡፡ ስለዚህም ሁልጊዜ ለፈጣሪዋ ጸሎቷ እባክህ አምላኬ ጠጠርነቴ ያብቃና ትልቅ ድናጋይ አርገኝ ነው፡፡ በህያዋን ፍጥረታት ከሚያስቀናት ነገር መካከል ከተወለዱበት ጊዜ ጀምሮ ማደግ መቻላቸው ነው፡፡ እነሱኮ እንደተፈጠሩ ባሉበት እንደድንጋይ እየረገጡ አይቀሩም እያለች ብዙ ጊዜ የአርባ ቀን ዕድሏን ታማርራለች፡፡

አንድ ቀን አንድ የበግ እረኛ መጣና እንደወትሮው በሰዎች የሚፈለጉትን ትላልቅ ጥቋቁር ድንጋዮች ትቶ ከበርካታ ጥቋቁር ጠጠሮች መሀል እሷንና ሌሎች እንደሷ ሚጢጢ የነበሩ አራት ባልንጀሮቿን በመውሰድ ኮረጆው ውስጥ ከቷቸው በመጣበት ፍጥነት ተመልሶ ሄደ፡፡

ትላልቆቹ ጥቋቁር ድጋዮች ይሄን ሲመለከቱ ተንጫጩ፡፡ “እኛ ትላልቆቹ እያለን ትናንሾቹ መመረጣቸው የምን አትርሱኝ ነው?” አሉ፡፡ በጣም ተበሳጩ፡፡ ተቆጡ፡፡ “ለካንስ ትናንሽ ጥቁር ድቡልቡል ጠጠሮችም ይፈለጋሉ” ሲሉ አሰቡ፡፡

ሌሎቹ ትናንሽ ጥቁር ድቡልቡል ጠጠሮች ደግሞ አቻዎቻቸው በመመረጣቸው ሐሴት አረጉ፡፡ ጊዜ መጣልን የመፈለጊያችን አሉ፡፡

የተመረጡት አምስት ጥቋቁር ድቡልቡል ጠጠሮች በትንሹ እረኛ ኮረጆ ውስጥ ሆነው ይንሾካሾካሉ፡፡`
    });
}